package com.example.completenewsapp;

import android.annotation.SuppressLint;
import android.content.Context;
import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.drawable.BitmapDrawable;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;

import androidx.activity.EdgeToEdge;
import androidx.appcompat.app.AppCompatActivity;
import androidx.cardview.widget.CardView;
import androidx.core.graphics.Insets;
import androidx.core.view.ViewCompat;
import androidx.core.view.WindowInsetsCompat;

import com.squareup.picasso.Picasso;

import java.util.ArrayList;
import java.util.HashMap;

public class MainActivity extends AppCompatActivity {

    ListView listView;

    ArrayList <HashMap <String, String > > arrayList = new ArrayList < > ();
    HashMap <String, String > hashMap = new HashMap < > ();

    @SuppressLint("MissingInflatedId")
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        EdgeToEdge.enable(this);


        setContentView(R.layout.activity_main);
        ViewCompat.setOnApplyWindowInsetsListener(findViewById(R.id.main), (v, insets) -> {
            Insets systemBars = insets.getInsets(WindowInsetsCompat.Type.systemBars());
            v.setPadding(systemBars.left, systemBars.top, systemBars.right, systemBars.bottom);
            return insets;
        });

        listView = findViewById(R.id.listView);

        hMap();
        hMap2();
        hMap3();
        hMap4();
        hMap5();
        hMap6();
        hMap7();
        hMap8();
        hMap9();
        hMap10();
        hMap11();
        hMap12();
        hMap13();
        hMap14();
        hMap15();


        MyAdapter myAdapter = new MyAdapter();
        listView.setAdapter(myAdapter);

    }


    private class MyAdapter extends BaseAdapter {

        LayoutInflater inflater;


        @Override
        public int getCount() {
            return arrayList.size();
        }

        @Override
        public Object getItem(int position) {
            return null;
        }

        @Override
        public long getItemId(int position) {
            return 0;
        }

        @Override
        public View getView(int position, View convertView, ViewGroup parent) {
            inflater = (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);
            @SuppressLint("ViewHolder") View view = inflater.inflate(R.layout.item, parent, false);

            ImageView coverImg = view.findViewById(R.id.image);
            TextView cat = view.findViewById(R.id.category);
            TextView title = view.findViewById(R.id.title);
            TextView desc = view.findViewById(R.id.description);

            HashMap <String, String > hashMap = arrayList.get(position);

            String category = hashMap.get("category");
            String title1 = hashMap.get("title");
            String description = hashMap.get("description");
            String image_url = hashMap.get("img_url");

            Picasso.get().load(image_url).into(coverImg);
            cat.setText(category);
            title.setText(title1);
            desc.setText(description);


            LinearLayout itemLayout = view.findViewById(R.id.itemLayout);
            @SuppressLint({"MissingInflatedId", "LocalSuppress"}) CardView itemCard = view.findViewById(R.id.itemCard);

            itemCard.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View v) {

                    Breif.TITLE = title1;
                    Breif.DESCRIPTION = description;

                    Bitmap bitmap = ((BitmapDrawable) coverImg.getDrawable())
                            .getBitmap();

                    Breif.COVER_IMG = bitmap;

                    startActivity(new Intent(MainActivity.this, Breif.class));

                }
            });


            return view;
        }
    }


    public void hMap () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "BUDGET");
        hashMap.put("title", "যেসব পণ্যের দাম বাড়তে পারে");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/06/budget-af664178f96bedb317bba8d96256bcb3.jpg?jadewits_media_id=9617https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/06/budget-af664178f96bedb317bba8d96256bcb3.jpg?jadewits_media_id=9617");

        hashMap.put("description", "আগামী অর্থবছরের (২০২৪-২৫) বাজেটে বেশকিছু পণ্য ও সেবায় শুল্ক-করারোপ করতে পারে সরকার। বাড়তে পারে আইসক্রিম, বেভারেজ, ইট, এলইডি বাল্ব, তামাকজাতীয় দ্রব্য ইত্যাদি পণ্যের দাম।\n" +
                "সংশ্লিষ্ট সূত্র জানায়, সিগারেটের উৎপাদন পর্যায়ে সম্পূরক শুল্ক ও মূল্যস্তর বাড়তে পারে। তিন স্তরের সিগারেটে সম্পূরক শুল্ক ৬৫.৫% প্রস্তাব করা হয়েছে। ফলে সব ধরনের সিগারেটের দাম বাড়তে পারে। প্রতি ১০ গ্রাম জর্দার সর্বোচ্চ খুচরা দাম ৪৮ টাকা ও একই পরিমাণ গুলের মূল্য ২৫ টাকা প্রস্তাব করা হয়েছে। যাদের পান-জর্দা খাওয়ার অভ্যাস আছে তাদের ব্যয় বাড়বে।\n" +
                "বাসাবাড়িতে ব্যবহৃত পানির ফিল্টার আমদানিতে শুল্ক বাড়ানো হচ্ছে। দেশে উৎপাদন হওয়ায় পানির ফিল্টার আমদানিতে শুল্ক ১০% থেকে বাড়িয়ে ১৫% করার সম্ভাবনা রয়েছে। বিদ্যুৎ বিল সাশ্রয়ে অনেকে বাসায় এলইডি বাল্ব ব্যবহার করেন। এলইডি বাল্ব এবং এনার্জি সেভিং বাল্ব উৎপাদনের উপকরণ আমদানিতে শুল্ক ১০% বাড়ানো হতে পারে।\n" +
                "কাজুবাদাম চাষকে সুরক্ষা দেওয়ার অংশ হিসেবে খোসা ছাড়ানো কাজুবাদাম আমদানিতে শুল্ক ৫% থেকে বাড়িয়ে ১০% করা হচ্ছে। ফলে আমদানি করা কাজুবাদামের দাম বাড়তে পারে। দেশে ফ্রিজ-এসি উৎপাদনে ব্যবহৃত কম্প্রেসার ও সব ধরনের উপকরণের ভ্যাট এবং শুল্ক বাড়ানো হচ্ছে। তাই এসি ও ফ্রিজের দাম বাড়তে পারে। এলআরপিসি তার আমদানিতে শুল্ক বাড়ানো হতে পারে। ফলে নির্মাণ খাতে খরচ বাড়বে।\n" +
                "গাড়ি সিএনজি-এলপিজিতে কনভার্সনে ব্যবহৃত কিট, সিলিন্ডার ও অন্য যন্ত্রপাতি, যন্ত্রাংশ আমদানিতে শুল্ক ৩% থেকে বাড়িয়ে ৫% করা হচ্ছে। গাড়ি কনভার্সন খরচ বাড়তে পারে। আবার লোডশেডিং মোকাবিলায় বাসাবাড়ি বা শিল্পে জেনারেটরের ব্যবহার বাড়ছে। সেখানেও নজর দিয়েছে এনবিআর। জেনারেটর সংযোজন ও উৎপাদনে ব্যবহৃত উপকরণ বা যন্ত্রাংশ আমদানিতে ১% শুল্ক আরোপ করা হচ্ছে। দেশের বাজারে জেনারেটরের দাম বাড়তে পারে। বিদেশ থেকে আমদানি করা ম্যাকরেল মাছ আমদানিতে ১৫% ভ্যাট ও ৫% অগ্রিম আয়কর যোগ করায় দাম বাড়তে পারে।\n" +
                "শিল্পে ব্যবহৃত ৩৩টি আইটেমের কাঁচামাল আমদানিতে ১% শুল্ক বসানো হচ্ছে। তালিকায় আছে অপরিশোধিত ভোজ্যতেল, শিরিষ কাগজ উৎপাদনে ব্যবহৃত টিউব লিসেনিং জেল, কৃত্রিম কোরান্ডাম, অ্যালুমিনিয়াম অক্সাইড, প্যাট চিপস উৎপাদনে ব্যবহৃত ইথাইলিন গ্লাইকল, পানির মোটর উৎপাদনকারী অ্যালুমিনিয়াম ইনগট, ফ্লোরোসেন্ট বাতির যন্ত্রাংশ, কাচ, প্লাস্টিক, এলইডি টেলিভিশন উৎপাদনে ব্যবহৃত এলইডি বাল্ব, বাতি উৎপাদনে ব্যবহৃত অ্যালুমিনিয়াম অ্যালয় প্রভৃতির দাম বাড়তে পারে।\n" +
                "অর্থনৈতিক অঞ্চল ও হাইটেক পার্কে শিল্পপ্রতিষ্ঠানের মূলধনী যন্ত্রাংশ ও নির্মাণসামগ্রী আমদানিতে রেয়াতি সুবিধা প্রত্যাহার করে ১% শুল্ক বসানো হচ্ছে। পাশাপাশি অর্থনৈতিক অঞ্চল উন্নয়নে ডেভেলপারের আনা ব্যবহৃত সামগ্রীতে ১% শুল্ক আরোপ এবং অর্থনৈতিক অঞ্চলে অবস্থিত প্রতিষ্ঠানের শুল্কমুক্ত সুবিধায় গাড়ি আমদানির সুযোগ বাতিল করা হচ্ছে। ফলে অর্থনৈতিক অঞ্চলে শিল্প স্থাপনকারী প্রতিষ্ঠানকে শুল্ক ছাড়া অন্য শুল্ক-কর (ভ্যাট, সম্পূরক শুল্ক, রেগুলেটরি শুল্ক) পরিশোধ করতে হবে।\n" +
                "ট্যুর অপারেটর সেবার ওপর বিদ্যমান মূসক অব্যাহতি প্রত্যাহারের প্রস্তাব করা হতে পারে। অ্যামিউজমেন্ট পার্ক, থিম পার্কে মূসক ৭.৫%-এর পরিবর্তে ১৫% করার প্রস্তাব দেওয়া হয়েছে। ফলে বাড়তে পারে ঘোরাঘুরির খরচ। নিলামকারী সংস্থা, সিকিউরিটি সার্ভিস ও লটারির টিকিটে মূসক ১০%-এর পরিবর্তে ১৫% করা প্রস্তাব করা হতে পারে। ইটের ক্ষেত্রে বিদ্যমান সুনির্দিষ্ট কর ১০ থেকে ২০% করার প্রস্তাব করা হতে পারে। ফলে বাড়বে নির্মাণ খরচ। আইসক্রিম ও কার্বোনেটেড বেভারেজের ওপর ভ্যাট বাড়ানোর প্রস্তাব করা হতে পারে। ফলে আইসক্রিম ও কোমলপানীয়ের দাম বাড়বে।\n" +
                "মোবাইল ফোনের সিম ব্যবহারে দেওয়া সেবার বিপরীতে সম্পূরক শুল্ক ৫% বাড়িয়ে ২০% করা হতে পারে। এতে মোবাইলে কথা বলা ও ইন্টারনেট ব্যবহারের খরচ বাড়তে পারে। ই-সিম সরবরাহের ক্ষেত্রে মূসক ২০০ টাকার বিপরীতে ৩০০ টাকা করার প্রস্তাব করা হয়েছে।\n" +
                "কিছু শর্ত প্রতিপালনসাপেক্ষে রেফারেল বা বিশেষায়িত হাসপাতাল শুল্কছাড় সুবিধায় ১% শুল্কে মেডিকেল যন্ত্র ও সরঞ্জাম আমদানির সুযোগ রয়েছে। বাজেটে ২০০টিরও বেশি মেডিকেল যন্ত্র ও সরঞ্জাম আমদানির ক্ষেত্রে তা বাড়িয়ে ১০% করা হতে পারে। ফলে গুরুতর অসুস্থ রোগীদের চিকিৎসার ব্যয় আরও বাড়তে পারে।\n");

        arrayList.add(hashMap);

    }

    public void hMap2 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");
        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }

    public void hMap3 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "MYSTERY");
        hashMap.put("title", "বাজেটে লাল ব্রিফকেস ব্যবহারের রহস্য কী?");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/06/Briefcase-5d8349392a52d6a3a3445b3ac47b7489.jpg?jadewits_media_id=9616");

        hashMap.put("description", "“সুখী, সমৃদ্ধ, উন্নত ও স্মার্ট বাংলাদেশ বিনির্মাণে অঙ্গীকার” এই শিরোনামকে সামনে রেখে ২০২৪-২৫ অর্থবছরের জন্য ৭ লাখ ৯৭ হাজার কোটি টাকার জাতীয় বাজেট প্রস্তাবের উদ্দেশ্যে জাতীয় সংসদ ভবনে পৌঁছেছেন অর্থমন্ত্রী আবুল হাসান মাহমুদ আলী।\n" +
                "\n" +
                "বৃহস্পতিবার (৬ জুন) দুপুরের দিকে ২০২৪-২৫ অর্থবছরের বাজেট ঘোষণার জন্য ব্রিফকেস হাতে নিয়ে সংসদ ভবনে পৌঁছান তিনি। বিকেলে জাতীয় সংসদে ২০২৪-২৫ অর্থবছরের জন্য বাজেট ঘোষণা করবেন অর্থমন্ত্রী।\n" +
                "\n" +
                "এটি দ্বাদশ জাতীয় সংসদের তৃতীয় অধিবেশন এবং প্রথম বাজেট অধিবেশন। দেশের ৫৩তম, আওয়ামী লীগ সরকারের ২৫তম বাজেট এবং অর্থমন্ত্রী আবুল হাসান মাহমুদ আলীর প্রথম বাজেট।\n" +
                "\n" +
                "এদিকে প্রতিবছরই বাজেট পেশ করতে একটি ব্রিফকেস নিয়ে সংসদে প্রবেশ করেন অর্থমন্ত্রী। অর্থমন্ত্রী বদলালেও রয়ে যায় এই ব্রিফকেস রীতি। কেন এই ব্রিফকেস, কীভাবে এলো এই ব্রিফকেস রীতি, কী কী থাকে এই ব্রিফকেসে, এসব নিয়ে কৌতূহলের যেন শেষ নেই।\n" +
                "\n" +
                "বাজেট কেন ব্রিফকেসে\n" +
                "\n" +
                "বিশ্বের সব দেশের বাজেট ঘোষণায় অর্থমন্ত্রীরা ব্রিফকেসে করে প্রয়োজনীয় নথিপত্র বহন করেন। বাজেট বক্তৃতায় ব্রিফকেসে থাকা লিখিত নথি থেকে তা পাঠ করেন তারা।\n" +
                "\n" +
                "সাবেক তত্ত্বাবধায়ক সরকারের অর্থ উপদেষ্টা আকবর আলি খান তার “বাংলাদেশে বাজেট: অর্থনীতি ও রাজনীতি” বইয়ে ব্রিফকেসের বিষয়টি উল্লেখ করেছেন।\n" +
                "\n" +
                "আকবর আলি খান লিখেছেন, শিল্পবিপ্লবের পর ইংল্যান্ডের অর্থনীতি অনেক বড় হয়ে যায়। বাজেটবিষয়ক প্রস্তাবগুলো শুধু একটা মানিব্যাগে সংকুলান করা সম্ভব হচ্ছিল না, সে জন্য মানিব্যাগের জায়গায় আসে ব্রিফকেস।\n" +
                "\n" +
                "বইটিতে ব্রিফকেস ব্যবহারের আরেকটি কারণ উল্লেখ করা হয়। সেটি হলো, বাজেটে কোন কর বাড়বে বা কোন কর কমবে, তার গোপনীয়তা বজায় রাখা অপরিহার্য। ব্রিফকেসের ভেতর থাকা বাজেটের তথ্য জেনে ব্যবসায়ীরা রাতারাতি তার প্রয়োগ করতে পারেন। তাই সংগত কারণেই সংসদে বাজেট পেশের আগে প্রস্তাবগুলো গোপন রাখা চাই। যে অর্থমন্ত্রী বাজেটের গোপনীয়তা বজায় রাখতে পারেন না, তার পক্ষে অর্থমন্ত্রীর দায়িত্ব পালন করা সম্ভব নয়।\n" +
                "\n" +
                "জানা গেছে, বাজেট ব্রিফকেসের এই রীতি শুরু হয় ১৮ শতক থেকে। প্রথম শুরু হয় যুক্তরাজ্যে। বাজেটপ্রধানকে ব্রিফকেস খুলে বাজেট পেশ করতে বলা হত। ১৮৬০ সালে ব্রিটেনের বাজেটপ্রধান উইলিয়াম ই গ্ল্যাডস্টোন লাল একটি স্যুটকেসে করে বাজেটসংক্রান্ত নথি নিয়ে আসেন। সেই স্যুটকেসের ওপর স্বর্ণ দিয়ে রানির মুখের আদলের ছাপ দেওয়া ছিল। ওই একই ব্যাগ বহু সরকারের আমলেই ব্যবহার করা হয়।\n" +
                "\n" +
                "প্রথা অনুযায়ী “লাল ব্রিফকেস” হাতে বাজেট পেশ করতে সংসদে ঢোকেন অর্থ বিভাগের প্রধান। তবে এই রহস্যময় ব্রিফকেসের রং সব সময় লাল ছিল না, অনেক সময়ই তা বদলেছে। তবে রং যা-ই হোক না কেন, এই ব্রিফকেসকে বাজেটের প্রতীক ধরা হয়।\n");

        arrayList.add(hashMap);

    }


    //Completed Till this


    public void hMap4 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }


    public void hMap5 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }


    public void hMap6 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }

    public void hMap7 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }

    public void hMap8 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }


    public void hMap9 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }


    public void hMap10 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }


    public void hMap11 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }


    public void hMap12 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }


    public void hMap13 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }

    public void hMap14 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }

    public void hMap15 () {

        HashMap <String, String > hashMap = new HashMap < > ();

        hashMap.put("category", "TOURISM");
        hashMap.put("title", "রাজশাহীতে পর্যটন নিয়ে কাজ করতে আগ্রহী ইন্দোনেশিয়া");
        hashMap.put("img_url","https://bcdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2024/06/05/rajshahi-1a326a5d6137eaf591d8b554721979e6.jpg?jadewits_media_id=9613");

        hashMap.put("description", "রাজশাহী সিটি কর্পোরেশনের মেয়র এ.এইচ.এম খায়রুজ্জামান লিটনের সঙ্গে বৈঠক করেছেন বাংলাদেশে নিযুক্ত ইন্দোনেশিয়ার রাষ্ট্রদূত হেরু হারতান্তো সুবোলো। \n" +
                "বুধবার (৫ জুন) বিকেল ৩টায় নগর ভবনের মেয়র দপ্তর কক্ষে এ বৈঠক অনুষ্ঠিত হয়। বৈঠকে রাজশাহীতে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটনখাতে কাজের আগ্রহ প্রকাশ করেছেন ইন্দোনেশীয় রাষ্ট্রদূত। সিটি কর্পোরেশনের সঙ্গে কাজের আগ্রহ প্রকাশ করায় ইন্দোনেশিয়ার রাষ্ট্রদূতকে আন্তরিক ধন্যবাদ জানান রাসিক মেয়র লিটন।\n" +
                "বৈঠকে ইন্দোনেশিয়ার রাষ্ট্রদূত হরু হারতান্তো সুবোলো বলেন, “ইন্দোনেশিয়ায় অনেক উন্নতমানের শিক্ষাপ্রতিষ্ঠান রয়েছে। ইন্দোনেশীয় শিক্ষাপ্রতিষ্ঠানগুলোতে রাজশাহীর শিক্ষার্থীদের এক বছর মেয়াদি বৃত্তি এবং শিল্পকলায় তিন মাস মেয়াদি বৃত্তি দিয়ে উভয় দেশের জ্ঞান ও সংস্কৃতি বিনিময় করতে চাই। এছাড়া রাজশাহী যেহেতু কৃষিপ্রধান অঞ্চল, তাই এ অঞ্চলের উৎপাদিত পণ্য নিয়ে কাজ করতে আমরা আগ্রহী।”\n" +
                "তিনি আরও বলেন, “এটি আমার রাজশাহীতে প্রথম সফর। রাজশাহীর পরিচ্ছন্নতা ও সিটি মেয়রের ভবিষ্যৎ পরিকল্পনা ও ভিশন দেখে মুগ্ধ হয়েছি।”\n" +
                "রাসিক মেয়র খায়রুজ্জামান লিটন বলেন, “ইন্দোনেশিয়া আমাদের বন্ধুপ্রতিম রাষ্ট্র। ইন্দোনেশিয়ার রাষ্ট্রদূতের সাথে দীর্ঘক্ষণ বৈঠক হয়েছে। তিনি রাজশাহীর সঙ্গে কৃষি, শিক্ষা, সংস্কৃতি ও পর্যটন ইত্যাদি খাতে সহযোগিতার আগ্রহ প্রকাশ করেছেন। সোলার প্ল্যান্ট স্থাপন, শিক্ষার্থীদের বৃত্তি ও পর্যটনের কোন কোন ক্ষেত্রে কাজ করা যায়, সেটি আমরা রাষ্ট্রদূতকে সুর্নিদিষ্টভাবে লিখিতভাবে জানাব।”\n" +
                "রাসিক মেয়র লিটন আরও বলেন, রাজশাহী কৃষিপ্রধান অঞ্চল। কৃষিপণ্যভিত্তিক শিল্প প্রতিষ্ঠার বিষয়ে আলোচনা করেছি। এছাড়া শিক্ষানগরী রাজশাহীতে অনেক শিক্ষাপ্রতিষ্ঠান রয়েছে। এখানকার শিক্ষার্থীদের বৃত্তি দেওয়ার বিষয়ে ইন্দোনেশিয়ার রাষ্ট্রদূত আগ্রহী। এটি চালু হলে জ্ঞান বিনিময়ে উভয় দেশ লাভবান হবে।\n.");

        arrayList.add(hashMap);

    }


}
